import { useState } from "react";
import { Link } from "react-router-dom";
import style from "../Footer.module.css"

const Aboutusmobile = () => {
    const [button,setButton]=useState(false);
    return ( <>
    <div className="mt-[12px]">
        <div className={`text-[#81858b] overflow-hidden ${button?"h-auto":"max-h-[70px]"} text-[.8rem] relative   `}>
            <h1 className={`text-[#424750] font-[700] leading-[20px] mb-[8px] ${button?"":`${style.bggradient}`} `}>فروشگاه اینترنتی دیجی‌کالا، بررسی، انتخاب و خرید آنلاین</h1>
            <p className=" ">
              یک
              <span className="text-[#81858b] font-bold"> خرید</span>
              اینترنتی مطمئن، نیازمند فروشگاهی است که بتواند کالاهایی متنوع،
              باکیفیت و دارای قیمت مناسب را در مدت زمان ی کوتاه به دست مشتریان
              خود برساند و ضمانت بازگشت کالا هم داشته باشد؛ ویژگی‌هایی که
              فروشگاه اینترنتی دیجی‌کالا سال‌هاست بر روی آن‌ها کار کرده و
              توانسته از این طریق مشتریان ثابت خود را داشته باشد.
              <span className="block"></span>
              یکی از مهم‌ترین دغدغه‌های کاربران دیجی‌کالا یا هر فروشگاه‌
              اینترنتی دیگری، این است که کالای خریداری شده چه زمانی به دستشان
              می‌رسد. دیجی‌کالا شیوه‌های مختلفی از ارسال را متناسب با فروشنده
              کالا،‌ مقصد کالا و همچنین نوع کالا در اختیار کاربران خود قرار
              می‌دهد. هر یک از روش های ارسال دیجی کالا شرایط و ویژگی‌های خاص خود
              را دارند که ممکن است گاهی برای کاربران جدید، مبهم و پیچیده به نظر
              برسند. برای آگاهی بیشتر مشتریان از خدمات دیجی‌کالا، این فروشگاه
              اینترنتی در بخشی از وب‌سایت خود راهنمای کاملی از شیوه‌‌های ارسال
              را به صورت ساده و به دور از پیچیدگی، قرار داده است که شامل 8 نوع
              ارسال کالا به روش‌های زیر است: ارسال امروز، دریافت حضوری، دریافت
              از گنجه، ارسال توسط فروشنده، ارسال عادی، ارسال کالاهای بزرگ، سنگین
              و فوق سنگین، ارسال سریع سوپرمارکتی، ارسال با پست
            </p>
            <p>کدام محصولات در دیجی‌کالا قابل سفارش هستند؟</p>
            <p>
              تقریبا می‌توان گفت محصولی وجود ندارد که دیجی‌کالا برای مشتریان خود
              در سراسر کشور فراهم نکرده باشد. شما می‌توانید در تمامی روزهای هفته
              و تمامی شبانه روز دیجی‌کالا که محصولات دارای تخفیف عالی می‌شوند،
              سفارش خود را به سادگی ثبت کرده و در روز و محدوده زمانی مناسب خود،
              درب منزل تحویل بگیرید. بعضی از گروه‌های اصلی و زیر مجموعه‌های
              پرطرفدار محصولات دیجی‌کالا شامل مواردی می‌شود که در ادامه به معرفی
              آن‌ها می‌پردازیم که امکان
              <span className="text-[#81858b] font-bold"> ارسال امروز</span>
              برای آن ها وجود دارد.
            </p>
            <p>
              دیجی کالا در جشنواره‌های سالیانه خود به طور معمول روی تمام دسته
              بندی‌های کالایی تخفیف‌های عالی قرار‌می‌دهد. به عنوان مثال در زمان
              <Link className="text-[#19bfd3]"> بلک فرایدی </Link>
              یا حراج جمعه سیاه، در این سال‌ها بیشترین درصد تخفیف در اختیار
              مشتریان دیجی‌کالا قرار گرفته‌است و شامل دسته بندی های مختلف از
              موبایل و لپ تاپ تا عطر و لباس و حتی غذای حیوانات خانگی بوده‌است.
            </p>
            <p>کالای دیجیتال</p>
            <p>
              انواع گوشی موبایل از برندهای مختلفی مثل آیفون،
              <Link className="text-[#19bfd3]"> ،گوشی سامسونگ </Link>
              <Link className="text-[#19bfd3]"> ،گوشی نوکیا </Link>
              <Link className="text-[#19bfd3]"> ،گوشی شیائومی </Link>
              <Link className="text-[#19bfd3]"> ،گوشی هواوی </Link>، و...، انواع
              کنسول بازی ps4 و ps5، انواع تبلت‌های پرطرفدار مثل
              <Link className="text-[#19bfd3]"> تبلت سامسونگ </Link>
              نوت 10، انواع هندزفری مثل
              <Link className="text-[#19bfd3]"> هندزفری بی سیم </Link>
              <Link className="text-[#19bfd3]"> تلوزیون </Link>
              از برندهای مختلف مثل تلویزیون سامسونگ، سونی و...، انواع مانیتور،
              کیس، کیبورد، مودم از برندهای مختلف مثل مودم ایرانسل، آنتن و ...
              تنها بخشی از محصولاتی هستند که زیر مجموعه کالای دیجیتال در
              دیجی‌کالا قرار دارند.
            </p>
            <p>خودرو، ابزار و تجهیزات صنعتی</p>
            <p>
              انواع خودروهای ایرانی و خارجی از برندهای مطرحی مثل هوندا، کیا
              و...، موتور سیکلت از برندهایی مثل کویر موتور و...، لوازم جانبی
              خودرو مثل سیستم صوتی تصویر، ضبط و...، لوازم یدکی مثل دیسک و صفحه
              کلاج و... و لوازم مصرفی خودرو مثل کفپوش سانا در این گروه قرار
              می‌گیرند.
            </p>
            <p>مد و پوشاک</p>
            <p>
              محصولاتی مثل انواع لباس مثل لباس مجلسی زنانه و مردانه، لباس راحتی،
              لباس ورزشی، اکسسوری، کیف، کفش، عینک آفتابی، لباس زیر، شال و روسری
              و... جزو مواردی هستند که می‌توانید آن‌ها را از برندهای مطرح ایرانی
              و خارجی موجود در دیجی کالا مثل آدیداس، نایکی، دبنهامز، آلدو، درسا
              و... خریداری کنید.
            </p>
            <p>اسباب بازی کودک و نوزاد</p>
            <p>
              در این دسته از کالاهای دیجی‌کالا، انواع لوازم بهداشتی و حمام کودک
              و نوزاد، انواع پوشاک و کفش،
              <Link className="text-[#19bfd3]"> ،تبلت </Link>
              <Link className="text-[#19bfd3]"> اسباب‌بازی </Link>، لوازم اتاق
              خواب کودک، لوازم ایمنی، لوازم شخصی و غذا خوری و ... قرار می‌گیرد
              تا خرید را برای پدر و مادرها به کاری سریع و آسان تبدیل کند.
            </p>
            <p>کالاهای سوپر مارکتی</p>
            <p>
              هر چیزی از مواد خوراکی که به آن نیاز دارید، در
              <Link className="text-[#19bfd3]"> سوپرمارکت </Link>
              دیجی‌کالا پیدا می‌شود، محصولات پرطرفداری مثل کره بادام‌زمینی، عسل،
              سس، قهوه، زعفران، شکلات، انواع نان و ... از برندهای معتبر و معروفی
              مثل نستله، نوتلا، استارباکس، مزمز، چی توز و ... همگی در اختیار شما
              هستند و تا رسیدن به آشپزخانه شما تنها چند کلیک فاصله دارند.
            </p>
            <p>زیبایی و سلامت</p>
            <p>
              انواع لوازم آرایش مثل لاک، رنگ مو، لوازم آرایش لب، چشم، صورت و...
              همگی در دیجی‌کالا موجود هستند. همچنین محصولات بهداشتی مثل انواع
              شامپو،
              <Link className="text-[#19bfd3]"> کرم ضد آفتاب </Link>، ماسک صورت،
              ضد تعریق، ماسک مو و...، انواع لوازم شخصی برقی، ست هدیه، بهترین
              انواع عطر و اسپری،
              <Link className="text-[#19bfd3]"> کرم پودر </Link>، ریمل و رژلب
              وانواع زیورآلات طلا و نقره مثل سرویس طلا، سرویس نقره و... به همراه
              وسایل مراقبت شخصی طبی در گروه زیبایی و سلامت دیجی‌کالا قرار
              می‌گیرد. در این بخش برندهای مطرحی مثل اسنس، پنبه ریز، سینره و...
              حضور دارند.همچنین میتوانید انواع مکمل غذایی و دارویی مثل داروی
              مناسب
              <Link className="text-[#19bfd3]"> سرماخوردگی </Link>
              را در دیجی کالا تهیه کنید.
            </p>
            <p>خانه و آشپزخانه</p>
            <p>
              یکی از متنوع‌ترین بخش‌های دیجی‌کالا، بخش لوازم خانه و آشپزخانه است
              که از محصولاتی مثل صندلی گیمینگ در بخش صندلی‌ها گرفته تا انواع مبل
              راحتی، انواع آبگرمکن مثل آبگرمکن بوتان، لباسشویی‌های متنوع مثل
              انواع لباسشویی اسنوا، شیرآلات مختلف مثل شیرآلات قهرمان و...، ظروف
              و همچنین لوازم برقی آشپزخانه مثل توستر و... را شامل می‌شود و امکان
              خریدی عالی را برای مشتریان فراهم کرده است. در بخش لوازم خانگی
              دیجی‌کالا، برندهای معتبری مثل تفال، اخوان، فیلیپس، ال جی، اسنوا،
              جی پلاس و... حضور دارند.
            </p>
            <p>کتاب، لوازم تحریر و هنر</p>
            <p>
              بخش هنر، کتاب، رمان و لوازم تحریر دیجی‌کالا نیز یکی از متنوع‌ترین
              بخش‌های این فروشگاه اینترنتی است. انواع کتاب و مجله، کتاب زبان،
              بازی، لوازم تحریر با طرح‌های مختلف مانند دختر کفشدوزکی، سازهایی
              مثل پیانو، سنتور، هنگ درام و... با بهترین قیمت‌ها و از بهترین
              برندها در دسترس شما قرار دارند.
            </p>
            <p>ورزش و سفر</p>
            <p>
              هر نوع وسیله و لباس ورزشی که فکرش را کنید، انواع وسایل کمپینگ و
              کوهنوردی، ساک و قمقمه ورزشی و وسایل سفر اربعین و... در این بخش
              قرار می‌گیرند. همچنین شما می‌توانید وسایل مد نظر خود را بر اساس
              نوع ورزش (آبی، هوازی، بدنسازی و...) در دسته‌بندی‌های دیجی‌کالا
              پیدا کنید.
            </p>
            <p>محصولات بومی و محلی</p>
            <p>
              و در آخر دیجی‌کالا از طریق به فروش رساندن محصولات بومی و سنتی
              متفاوتی مثل انواع خوراکی، گلیم و گبه، ابزار و ... تلاش کرده تا بین
              هنر ایرانی و متقاضیان آن کوتاه‌ترین راه را پیدا کند. در این بخش
              شما می‌توانید انواع محصولات از جمله ظروف زیبای مخصوص به سفره
              هفت‌سین و پذیرایی از مهمانان در روزهای نوروز، انواع آیینه و شمعدان
              و هر آن چیزی را که برای خلق زیبایی در روزهای بهاری به آن نیاز
              دارید، با قیمت مناسب و تنوع بسیار بالا انتخاب کنید. همچنین در صفحه
              <span className="text-[#81858b] font-bold"> برچسب ها </span>،
              امکان مشاهده و خرید انواع محصولات با طرح های بومی وجود دارد.
              دیجی‌کالا همچنین برای اینکه حال و هوای عید را به اعضای خود هدیه
              کند، تقویم ۱۴۰۱، انواع ایده عکس پروفایل عید نوروز، آهنگ‌های عید
              نوروز و موزیک‌های شاد بهاری، وسایل مربوط به خانه‌تکانیی و انواع
              لباس های عید را برای شما فراهم کرده است تا بتوانید در کنار خرید
              خود، از این حال و هوای تازه نهایت لذت را ببرید.
            </p>
        </div>
        <button className="flex items-center text-[1rem] font-bold leading-[2] cursor-pointer text-[#19bfd3]" onClick={()=>setButton(!button)}>
            <div className="flex items-center justify-center gap-1 text-[#a1a3a8]">
                <span>{button?"بستن":"مشاهده بیشنر"}</span>
                <div className="flex">
                <svg
                width="18"
                height="18"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M15 20.9203C14.81 20.9203 14.62 20.8503 14.47 20.7003L7.95003 14.1803C6.89003 13.1203 6.89003 11.3803 7.95003 10.3203L14.47 3.80026C14.76 3.51026 15.24 3.51026 15.53 3.80026C15.82 4.09026 15.82 4.57026 15.53 4.86026L9.01003 11.3803C8.53003 11.8603 8.53003 12.6403 9.01003 13.1203L15.53 19.6403C15.82 19.9303 15.82 20.4103 15.53 20.7003C15.38 20.8403 15.19 20.9203 15 20.9203Z"
                  fill="#a1a3a8"
                />
              </svg>
                </div>
            </div>
        </button>
    </div>
    </> );
}
 
export default Aboutusmobile;