import { Link } from "react-router-dom";

const Importantlink = () => {
    return ( <>
    <div className="w-full max-w-[1488px] h-[270.2px] flex flex-wrap justify-between mb-[32px] ">
        {/* feature1 */}
        <div className=" flex flex-col h-full justify-around grow ">
            <p className="mb-[8px] text-[1rem] font-bold">با دیجی‌کالا</p>
            <Link className="  mb-[8px] text-[#81858b] text-[1rem] font-normal block ">اتاق خبر دیجی‌کالا</Link>
            <Link className="  mb-[8px] text-[#81858b] text-[1rem] font-normal block ">فروش در دیجی‌کالا</Link>
            <Link className="  mb-[8px] text-[#81858b] text-[1rem] font-normal block ">فرصت‌های شغلی</Link>
            <Link className="  mb-[8px] text-[#81858b] text-[1rem] font-normal block ">گزارش تخلف در دیجی‌کالا</Link>
            <Link className="  mb-[8px] text-[#81858b] text-[1rem] font-normal block ">تماس با دیجی‌کالا</Link>
            <Link className="  mb-[8px] text-[#81858b] text-[1rem] font-normal block ">درباره دیجی‌کالا</Link>
        </div>
        {/* end feature1 */}
        {/* feature2 */}
        <div className=" flex flex-col h-full justify-around grow ">
            <p className="mb-[8px] text-[1rem] font-bold">خدمات مشتریان</p>
            <Link className=" mb-[8px] text-[#81858b] text-[1rem] font-normal block ">پاسخ به پرسش‌های متداول</Link>
            <Link className=" mb-[8px] text-[#81858b] text-[1rem] font-normal block ">رویه‌های بازگرداندن کالا</Link>
            <Link className=" mb-[8px] text-[#81858b] text-[1rem] font-normal block ">شرایط استفاده</Link>
            <Link className=" mb-[8px] text-[#81858b] text-[1rem] font-normal block ">حریم خصوصی دیجی‌کالا</Link>
            <Link className=" mb-[8px] text-[#81858b] text-[1rem] font-normal block ">گزارش باگ</Link>
            
        </div>
        {/* end feature2 */}
        {/* feature3 */}
        <div className=" flex flex-col h-full justify-around grow ">
            <p className="mb-[8px] text-[1rem] font-bold">راهنمای خرید از دیجی‌کالا</p>
            <Link className=" mb-[8px] text-[#81858b] text-[1rem] font-normal block ">نحوه ثبت سفارش</Link>
            <Link className=" mb-[8px] text-[#81858b] text-[1rem] font-normal block ">رویه ارسال سفارش</Link>
            <Link className=" mb-[8px] text-[#81858b] text-[1rem] font-normal block ">شیوه‌های پرداخت</Link>
        </div>
        {/* end feature3 */}
        {/* feature4 */}
        <div className="flex flex-col h-full justify-around  ">
            <p className="mb-[8px] text-[1rem] font-bold">همراه ما باشید!</p>
            <div className="  flex items-center">
                {/* instagram */}
                <Link className=" me-[32px]">
                <div className=" flex">
                <svg width="40" height="40" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M15 23.0002H9C3.57 23.0002 1.25 20.6802 1.25 15.2502V9.25024C1.25 3.82024 3.57 1.50024 9 1.50024H15C20.43 1.50024 22.75 3.82024 22.75 9.25024V15.2502C22.75 20.6802 20.43 23.0002 15 23.0002ZM9 3.00024C4.39 3.00024 2.75 4.64024 2.75 9.25024V15.2502C2.75 19.8602 4.39 21.5002 9 21.5002H15C19.61 21.5002 21.25 19.8602 21.25 15.2502V9.25024C21.25 4.64024 19.61 3.00024 15 3.00024H9Z" fill="#81858b"/>
<path d="M12 16.5002C9.66 16.5002 7.75 14.5902 7.75 12.2502C7.75 9.91024 9.66 8.00024 12 8.00024C14.34 8.00024 16.25 9.91024 16.25 12.2502C16.25 14.5902 14.34 16.5002 12 16.5002ZM12 9.50024C10.48 9.50024 9.25 10.7302 9.25 12.2502C9.25 13.7702 10.48 15.0002 12 15.0002C13.52 15.0002 14.75 13.7702 14.75 12.2502C14.75 10.7302 13.52 9.50024 12 9.50024Z" fill="#81858b"/>
<path d="M17 7.75027C16.87 7.75027 16.74 7.72027 16.62 7.67027C16.5 7.62027 16.39 7.55027 16.29 7.46027C16.2 7.36027 16.12 7.25027 16.07 7.13027C16.02 7.01027 16 6.88027 16 6.75027C16 6.62027 16.02 6.49027 16.07 6.37027C16.13 6.24027 16.2 6.14027 16.29 6.04027C16.34 6.00027 16.39 5.95027 16.44 5.92027C16.5 5.88027 16.56 5.85027 16.62 5.83027C16.68 5.80027 16.74 5.78027 16.81 5.77027C17.13 5.70027 17.47 5.81027 17.71 6.04027C17.8 6.14027 17.87 6.24027 17.92 6.37027C17.97 6.49027 18 6.62027 18 6.75027C18 6.88027 17.97 7.01027 17.92 7.13027C17.87 7.25027 17.8 7.36027 17.71 7.46027C17.61 7.55027 17.5 7.62027 17.38 7.67027C17.26 7.72027 17.13 7.75027 17 7.75027Z" fill="#81858b"/>
</svg>

                </div>
                </Link>
                {/* end instagram */}
                {/* twitter */}
                <Link className=" me-[32px]">
                <div className=" flex text-center">
                <svg xmlns:xlink="http://www.w3.org/1999/xlink" xmlns="http://www.w3.org/2000/svg" width="40" height="40"><defs><symbol id="twitter" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M21 6.73a7.374 7.374 0 01-2.12.581 3.708 3.708 0 001.623-2.041 7.444 7.444 0 01-2.346.896 3.693 3.693 0 00-6.292 3.367 10.483 10.483 0 01-7.61-3.858 3.665 3.665 0 00-.5 1.856 3.69 3.69 0 001.642 3.073 3.692 3.692 0 01-1.673-.464v.046a3.696 3.696 0 002.962 3.621c-.31.083-.636.13-.973.13-.238 0-.47-.024-.695-.07a3.695 3.695 0 003.448 2.565 7.409 7.409 0 01-4.585 1.579c-.298 0-.592-.018-.881-.051a10.437 10.437 0 005.66 1.661c6.793 0 10.506-5.626 10.506-10.505l-.013-.478A7.373 7.373 0 0021 6.73z"></path></symbol></defs><g><path d="M21 6.73a7.374 7.374 0 01-2.12.581 3.708 3.708 0 001.623-2.041 7.444 7.444 0 01-2.346.896 3.693 3.693 0 00-6.292 3.367 10.483 10.483 0 01-7.61-3.858 3.665 3.665 0 00-.5 1.856 3.69 3.69 0 001.642 3.073 3.692 3.692 0 01-1.673-.464v.046a3.696 3.696 0 002.962 3.621c-.31.083-.636.13-.973.13-.238 0-.47-.024-.695-.07a3.695 3.695 0 003.448 2.565 7.409 7.409 0 01-4.585 1.579c-.298 0-.592-.018-.881-.051a10.437 10.437 0 005.66 1.661c6.793 0 10.506-5.626 10.506-10.505l-.013-.478A7.373 7.373 0 0021 6.73z"></path></g></svg>
                </div>
                </Link>
                {/* end twitter */}
                {/* instagram */}
                <Link className=" me-[32px]">
                <div className=" flex">
                <svg width="40" height="40" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M15 23.0002H9C3.57 23.0002 1.25 20.6802 1.25 15.2502V9.25024C1.25 3.82024 3.57 1.50024 9 1.50024H15C20.43 1.50024 22.75 3.82024 22.75 9.25024V15.2502C22.75 20.6802 20.43 23.0002 15 23.0002ZM9 3.00024C4.39 3.00024 2.75 4.64024 2.75 9.25024V15.2502C2.75 19.8602 4.39 21.5002 9 21.5002H15C19.61 21.5002 21.25 19.8602 21.25 15.2502V9.25024C21.25 4.64024 19.61 3.00024 15 3.00024H9Z" fill="#81858b"/>
<path d="M12 16.5002C9.66 16.5002 7.75 14.5902 7.75 12.2502C7.75 9.91024 9.66 8.00024 12 8.00024C14.34 8.00024 16.25 9.91024 16.25 12.2502C16.25 14.5902 14.34 16.5002 12 16.5002ZM12 9.50024C10.48 9.50024 9.25 10.7302 9.25 12.2502C9.25 13.7702 10.48 15.0002 12 15.0002C13.52 15.0002 14.75 13.7702 14.75 12.2502C14.75 10.7302 13.52 9.50024 12 9.50024Z" fill="#81858b"/>
<path d="M17 7.75027C16.87 7.75027 16.74 7.72027 16.62 7.67027C16.5 7.62027 16.39 7.55027 16.29 7.46027C16.2 7.36027 16.12 7.25027 16.07 7.13027C16.02 7.01027 16 6.88027 16 6.75027C16 6.62027 16.02 6.49027 16.07 6.37027C16.13 6.24027 16.2 6.14027 16.29 6.04027C16.34 6.00027 16.39 5.95027 16.44 5.92027C16.5 5.88027 16.56 5.85027 16.62 5.83027C16.68 5.80027 16.74 5.78027 16.81 5.77027C17.13 5.70027 17.47 5.81027 17.71 6.04027C17.8 6.14027 17.87 6.24027 17.92 6.37027C17.97 6.49027 18 6.62027 18 6.75027C18 6.88027 17.97 7.01027 17.92 7.13027C17.87 7.25027 17.8 7.36027 17.71 7.46027C17.61 7.55027 17.5 7.62027 17.38 7.67027C17.26 7.72027 17.13 7.75027 17 7.75027Z" fill="#81858b"/>
</svg>

                </div>
                </Link>
                {/* end instagram */}
                {/* instagram */}
                <Link className=" me-[32px]">
                <div className=" flex">
                <svg width="40" height="40" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M15 23.0002H9C3.57 23.0002 1.25 20.6802 1.25 15.2502V9.25024C1.25 3.82024 3.57 1.50024 9 1.50024H15C20.43 1.50024 22.75 3.82024 22.75 9.25024V15.2502C22.75 20.6802 20.43 23.0002 15 23.0002ZM9 3.00024C4.39 3.00024 2.75 4.64024 2.75 9.25024V15.2502C2.75 19.8602 4.39 21.5002 9 21.5002H15C19.61 21.5002 21.25 19.8602 21.25 15.2502V9.25024C21.25 4.64024 19.61 3.00024 15 3.00024H9Z" fill="#81858b"/>
<path d="M12 16.5002C9.66 16.5002 7.75 14.5902 7.75 12.2502C7.75 9.91024 9.66 8.00024 12 8.00024C14.34 8.00024 16.25 9.91024 16.25 12.2502C16.25 14.5902 14.34 16.5002 12 16.5002ZM12 9.50024C10.48 9.50024 9.25 10.7302 9.25 12.2502C9.25 13.7702 10.48 15.0002 12 15.0002C13.52 15.0002 14.75 13.7702 14.75 12.2502C14.75 10.7302 13.52 9.50024 12 9.50024Z" fill="#81858b"/>
<path d="M17 7.75027C16.87 7.75027 16.74 7.72027 16.62 7.67027C16.5 7.62027 16.39 7.55027 16.29 7.46027C16.2 7.36027 16.12 7.25027 16.07 7.13027C16.02 7.01027 16 6.88027 16 6.75027C16 6.62027 16.02 6.49027 16.07 6.37027C16.13 6.24027 16.2 6.14027 16.29 6.04027C16.34 6.00027 16.39 5.95027 16.44 5.92027C16.5 5.88027 16.56 5.85027 16.62 5.83027C16.68 5.80027 16.74 5.78027 16.81 5.77027C17.13 5.70027 17.47 5.81027 17.71 6.04027C17.8 6.14027 17.87 6.24027 17.92 6.37027C17.97 6.49027 18 6.62027 18 6.75027C18 6.88027 17.97 7.01027 17.92 7.13027C17.87 7.25027 17.8 7.36027 17.71 7.46027C17.61 7.55027 17.5 7.62027 17.38 7.67027C17.26 7.72027 17.13 7.75027 17 7.75027Z" fill="#81858b"/>
</svg>

                </div>
                </Link>
                {/* end instagram */}
            </div>
        <div className="  mt-[32px] flex flex-col justify-center items-start">
            <h4 className=" h-[33.6px] mb-[12px] font-bold text-[1rem]">با ثبت ایمیل، از جدید‌ترین تخفیف‌ها با‌خبر شوید</h4>
            <div className=" h-[48px] flex items-center">
                <form action="" className="flex">
                    <label htmlFor="email" className=" h-[48px]">
                        <div className="px-[8px] h-[48px] bg-[#f0f0f1] rounded-[8px] flex items-center ">
                            <div className="  flex">
                                <input type="email" className="px-[8px] bg-transparent" placeholder="ایمیل شما" />
                            </div>
                        </div>
                        <p className="text-[#b2001a] mt-[4px] text-[.6rem] font-bold">اینجا را خالی نگذارید</p>
                    </label>
                    <button className="  px-[16px] py-[12px] ms-[8px] rounded-[8px] text-[1rem] font-bold bg-[#e0e0e2] text-white">ثبت</button>
                </form>
            </div>
        </div>
        </div>
        {/* end feature4 */}
    </div>
    </> );
}
 
export default Importantlink;